import streamlit as st  #导入Streamlit并用st代表它
import pandas as pd    #  导入Pandas并用pd代替
import numpy as np    # 导入numpy并用np代表它

st.title(":red[🍚南宁美食]")
st.header("南宁美食地图")
#准备地图坐标点数据经度、纬度
map_data={
    'longitude':[108.437870,108.278592,108.374932,108.374267,108.378977],
    'latitude':[22.769158,22.781611,22.765947,22.765353,22.765393],
}

st.map(pd.DataFrame(map_data))
# 定义数据,以便创建数据框
data = {
    '1号门店':[200, 150, 180,120,145,125,133,178,165,188,179,135],
    '2号门店':[120, 145, 123,165,189,124,125,145,123,156,158,158],
    '3号门店':[110, 100, 160,120,130,164,157,159,211,230,146,145],
    '4号门店':[200, 210, 215,195,189,178,189,186,185,145,165,145],
    '5号门店':[300, 256, 250,145,155,233,146,146,198,168,250,146]
}

df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series(['01','02', '03','04','05','06','07','08','09','10','11','12'], name='月份')
# 将新索引应用到数据框上
df.index = index

st.header(":red[门店数据]")
#展示数据
st.table(df)
#折线图
st.line_chart(df)
#柱形图
st.bar_chart(df)
#面积图
st.area_chart(df)
